#Представьте, что у вас есть таблица из 10 учеников с оценками учеников по 5 разным предметам.

import pandas as pd

data = {
    "Имя" : ['Александр', 'Мария', 'Дмитрий', 'Анна', 'Сергей',  'Екатерина', 'Иван', 'Ольга', 'Николай', 'Татьяна'],
    'Математика': [5, 4, 3, 5, 4, 5, 3, 4, 5, 2],
    'Физика': [4, 5, 3, 4, 4, 5, 2, 3, 4, 3],
    'Химия': [5, 4, 5, 3, 4, 5, 3, 4, 5, 4],
    'История': [3, 5, 4, 4, 5, 3, 4, 5, 3, 4],
    'Литература': [4, 3, 5, 4, 3, 4, 5, 3, 4, 5]
}

df = pd.DataFrame(data)

print(df.head())

Mathematics = df["Математика"].mean()
Physics = df['Физика'].mean()
Chemistry = df["Химия"].mean()
History = df["История"].mean()
Literature = df["Литература"].mean()

print(f"Средняя оценка по математике - {Mathematics}")
print(f"Средняя оценка по физике - {Physics}")
print(f"Средняя оценка по химии - {Chemistry}")
print(f"Средняя оценка по истории - {History}")
print(f"Средняя оценка по литературе - {Literature}")

Mathematics1 = df["Математика"].median()
Physics1 = df['Физика'].median()
Chemistry1 = df["Химия"].median()
History1 = df["История"].median()
Literature1 = df["Литература"].mean()

print(f"Медианная оценка по математике - {Mathematics1}")
print(f"Медианная оценка по физике - {Physics1}")
print(f"Медианная оценка по химии - {Chemistry1}")
print(f"Медианная оценка по истории - {History1}")
print(f"Медианная оценка по литературе - {Literature1}")

Q1_math = df['Математика'].quantile(0.25)

Q3_math = df['Математика'].quantile(0.75)

IQR = Q3_math - Q1_math

print(f"Квартиль 1 по математике - {Q1_math}")
print(f"Квартиль 3 по математике - {Q3_math}")
print(f"Межквартальный размах по математике - {IQR }")

stdM = df["Математика"].std()
stdP = df["Физика"].std()
stdC = df["Химия"].std()
stdH = df["История"].std()
stdL = df["Литература"].std()

print(f"Среднее отклонение по математике - {stdM}")
print(f"Среднее отклонение по физике - {stdP}")
print(f"Среднее отклонение по химии - {stdC}")
print(f"Среднее отклонение по истории - {stdH}")
print(f"Среднее отклонение по литературе - {stdL}")